Repository: S3b0/Ecom.Terminal
Catalog: Resources/Private/Translations/*/Auth.xlf
Languages: de

# fm.loginSuccess.title
source: Login successful
de: Login erfolgreich

# fm.loginSuccess.message
source: You have successfully logged in.
de: Sie haben sich erfolgreich angemeldet.

# fm.authenticationFailed.title
source: Authentication failed
de: Authentifizierung fehlgeschlagen

# fm.logoutSuccess.title
source: Logout successful
de: Logout erfolgreich

# fm.logoutSuccess.message
source: You have successfully logged out.
de: Sie haben sich erfolgreich abgemeldet.

# fm.accountCreated.title
source: Account {name} created
de: Der Account {name} wurde angelegt

# fm.validation.username.tooShort.title
source: Username too short
de: Benutzername zu kurz

# fm.validation.username.tooShort.message
source: Username must be at least {length} characters long.
de: Der Benutzername muss mindestens {length} Zeichen lang sein.

# fm.validation.username.invalidChars.title
source: Invalid characters found in username
de: Ungültige Zeichen im Benutzernamen gefunden

# fm.validation.username.invalidChars.message
source: Username must contain alphanumeric characters, hyphens and underscores only.
de: Der Benutzername darf nur alphanumerische Zeichen, Binde- und Unterstriche enthalten.

# fm.validation.username.duplicate.title
source: User '{identifier}' already exists
de: Benutzer '{identifier}' existiert

# fm.validation.username.duplicate.message
source: Please choose another username.
de: Bitte wählen Sie einen anderen Benutzernamen.

# fm.validation.password.failed.title
source: Password validation failed
de: Passwort-Validierung fehlgeschlagen

# fm.validation.password.tooShort.message
source: Password must be at least {length} characters long.
de: Das Passwort muss mindestens {length} Zeichen lang sein.

# fm.validation.password.usernameSimilar.message
source: The password is based on the username. Fail!
de: Das Passwort baut auf den Nutzernamen auf. Fail!

# fm.validation.password.tooManyUCChars.message
source: The password has too many upper case characters.
de: Das Passwort enthält zu viele Großbuchstaben.

# fm.validation.password.tooManyLCChars.message
source: The password has too many lower case characters.
de: Das Passwort enthält zu viele Kleinbuchstaben.

# fm.validation.password.tooManyNumChars.message
source: The password has too many numeric characters.
de: Das Passwort enthält zu viele Zahlen.

# fm.validation.password.tooManySpecChars.message
source: The password has too many special characters.
de: Das Passwort enthält zu viele Sonderzeichen.

# fm.validation.password.dictBased.message
source: The password is based on a dictionary word.
de: Das Passwort basiert auf einem Wort aus dem Wörterbuch.

# fm.validation.password.dblCheckFailed.title
source: Wrong password confirmation
de: Fehlerhafte Passwortbestätigung (-wiederholung)

# fm.validation.password.dblCheckFailed.message
source: Entered passwords do not match.
de: Die eingegebenen Passwörter stimmen nicht überein.
